| Description   |                 |
|---------------|-----------------|
| keywords      |                 |
| dir-name      |                 |
| dir-name-en   |                 |
| tenant-type   | MySQL Mode      |

# ZIPF

## Syntax

```sql
ZIPF(<s> , <N> , <gen>)
```

## Purpose

`ZIPF()` returns a Zipf-distributed integer in the value range of [0, N) and with the distribution exponent of `s`. 

* The larger the `s`, the more skewed the generated sequence, and the steeper the curve of the sequence. 
* `s` and `N` must be scalar values that do not change with row iteration. For example, they can be integral or floating-point constants and scalar functions. In PL, they can also be `@v1` and `1+@v3`. The value range of `s` is [1, + âˆž). The value range of `N` is [1, 16777215]. 
* The amount of storage and computing resources consumed by the Zipf algorithm is related to the value of `N`. The space complexity of the algorithm is `O(N)`. The time complexity is `O(logN)` for the generation of each integer. Therefore, the value range of `N` is limited to [1, 16777215]. 
* `gen` is a numeric value generation function. Generally, the `RANDOM()` function is used. If the input value is a constant, `ZIPF()` returns a fixed value. 

## Examples

The following example shows how to use the `ZIPF()` function to return a Zipf-distributed integer. 

```shell
obclient> SELECT ZIPF(1, 10, RANDOM()) FROM TABLE(GENERATOR(6));
+-----------------------+
| ZIPF(1, 10, RANDOM()) |
+-----------------------+
|                     4 |
|                     5 |
|                     2 |
|                     1 |
|                     0 |
|                     2 |
+-----------------------+
6 rows in set

obclient> SELECT ZIPF(1, 10, 0415) FROM TABLE(GENERATOR(6));
+-------------------+
| ZIPF(1, 10, 0415) |
+-------------------+
|                 8 |
|                 8 |
|                 8 |
|                 8 |
|                 8 |
|                 8 |
+-------------------+
6 rows in set

obclient> SELECT ZIPF(ABS(-1), 23, RANDOM()) FROM DUAL;
+-----------------------------+
| ZIPF(ABS(-1), 23, RANDOM()) |
+-----------------------------+
|                           1 |
+-----------------------------+
1 row in set
```

The following example shows that the distribution of the result returned by `ZIPF()` is related with the value of `s`. 

```shell
obclient> SELECT  COUNT(*), ZIPF(1, 10, RANDOM()) v FROM TABLE(GENERATOR(10000)) GROUP BY v ORDER BY 1;
+----------+------+
| COUNT(*) | v    |
+----------+------+
|      350 |    9 |
|      369 |    8 |
|      450 |    7 |
|      488 |    6 |
|      559 |    5 |
|      727 |    4 |
|      877 |    3 |
|     1100 |    2 |
|     1755 |    1 |
|     3325 |    0 |
+----------+------+
10 rows in set

obclient> SELECT COUNT(*), ZIPF(2, 10, RANDOM()) v FROM TABLE(GENERATOR(10000)) GROUP BY v ORDER BY 1;
+----------+------+
| COUNT(*) | v    |
+----------+------+
|       69 |    9 |
|       73 |    8 |
|      102 |    7 |
|      118 |    6 |
|      187 |    5 |
|      260 |    4 |
|      419 |    3 |
|      679 |    2 |
|     1632 |    1 |
|     6461 |    0 |
+----------+------+
10 rows in set

obclient> SELECT COUNT(*), ZIPF(3, 10, RANDOM()) v FROM TABLE(GENERATOR(10000)) GROUP BY v ORDER BY 1;
+----------+------+
| COUNT(*) | v    |
+----------+------+
|        6 |    9 |
|       12 |    8 |
|       15 |    7 |
|       35 |    5 |
|       40 |    6 |
|       77 |    4 |
|      118 |    3 |
|      292 |    2 |
|     1106 |    1 |
|     8299 |    0 |
+----------+------+
10 rows in set

obclient> SELECT COUNT(*), ZIPF(4, 10, RANDOM()) v FROM TABLE(GENERATOR(10000)) GROUP BY v ORDER BY 1;
+----------+------+
| COUNT(*) | v    |
+----------+------+
|        1 |    8 |
|        1 |    7 |
|        1 |    9 |
|        2 |    5 |
|        6 |    6 |
|       19 |    4 |
|       35 |    3 |
|      120 |    2 |
|      548 |    1 |
|     9267 |    0 |
+----------+------+
10 rows in set

obclient> SELECT COUNT(*), ZIPF(5, 10, RANDOM()) v FROM TABLE(GENERATOR(10000)) GROUP BY v ORDER BY 1;
+----------+------+
| COUNT(*) | v    |
+----------+------+
|        2 |    5 |
|        3 |    4 |
|       18 |    3 |
|       31 |    2 |
|      309 |    1 |
|     9637 |    0 |
+----------+------+
6 rows in set
```
